---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.Username
source: html/2a7c8664-de0d-7a43-e670-2e733e579609.htm
---
# Autodesk.Revit.ApplicationServices.Application.Username Property

Gets the user name for the current Revit session.

## Syntax (C#)
```csharp
public string Username { get; }
```